hw05/submit/task1/load/23127296_Load_20260815_html/statistics.json
{
  "05 GET /api/categories" : {
    "transaction" : "05 GET /api/categories",
    "sampleCount" : 321,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.420560747663551,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 4.0,
    "throughput" : 0.5451803341055306,
    "receivedKBytesPerSec" : 0.19060015586892573,
    "sentKBytesPerSec" : 0.17143365974802816
  },
  "07 GET /api/cart" : {
    "transaction" : "07 GET /api/cart",
    "sampleCount" : 317,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1356466876971612,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 0.5437597988260278,
    "receivedKBytesPerSec" : 1.026330539059793,
    "sentKBytesPerSec" : 0.16780087541896951
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2888,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.06163434903047,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 249.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 7.0,
    "throughput" : 4.829487970594974,
    "receivedKBytesPerSec" : 5.787771554182072,
    "sentKBytesPerSec" : 1.6373078494438897
  },
  "06 POST /api/cart" : {
    "transaction" : "06 POST /api/cart",
    "sampleCount" : 320,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.3937500000000003,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 0.5436398386069229,
    "receivedKBytesPerSec" : 0.1560840942875345,
    "sentKBytesPerSec" : 0.2020582262688469
  },
  "02 GET /api/products" : {
    "transaction" : "02 GET /api/products",
    "sampleCount" : 325,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.403076923076924,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 0.5450157886881554,
    "receivedKBytesPerSec" : 0.6642379924636894,
    "sentKBytesPerSec" : 0.17031743396504856
  },
  "03 GET /api/products search" : {
    "transaction" : "03 GET /api/products search",
    "sampleCount" : 323,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.414860681114551,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.759999999999991,
    "throughput" : 0.5450179788438532,
    "receivedKBytesPerSec" : 0.14210918003057502,
    "sentKBytesPerSec" : 0.17830013237356174
  },
  "04 GET /api/products/:id" : {
    "transaction" : "04 GET /api/products/:id",
    "sampleCount" : 323,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5139318885448916,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 33.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 5.0,
    "throughput" : 0.5455085896491856,
    "receivedKBytesPerSec" : 0.24686196658802112,
    "sentKBytesPerSec" : 0.17153688072952908
  },
  "01 POST /api/login" : {
    "transaction" : "01 POST /api/login",
    "sampleCount" : 325,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.135384615384614,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 39.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 19.40000000000009,
    "throughput" : 0.5455125300031892,
    "receivedKBytesPerSec" : 0.3622544144552428,
    "sentKBytesPerSec" : 0.21002560237172063
  },
  "09 GET /api/orders/my-orders" : {
    "transaction" : "09 GET /api/orders/my-orders",
    "sampleCount" : 317,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.779179810725552,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.819999999999993,
    "throughput" : 0.5438876125735835,
    "receivedKBytesPerSec" : 2.9495374006375665,
    "sentKBytesPerSec" : 0.17421400090247596
  },
  "08 POST /api/checkout" : {
    "transaction" : "08 POST /api/checkout",
    "sampleCount" : 317,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.410094637223971,
    "medianResTime" : 6.0,
    "minResTime" : 3.0,
    "maxResTime" : 249.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 14.919999999999959,
    "throughput" : 0.5435332404011516,
    "receivedKBytesPerSec" : 0.16666937254488437,
    "sentKBytesPerSec" : 0.2159277422280748
  }
}